###################################################################

# Created by write_sdc on Mon Mar  2 11:39:13 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_load -pin_load 0.05 [get_ports wr_ready]
set_load -pin_load 0.05 [get_ports rd_out_valid]
set_load -pin_load 0.05 [get_ports {rd_data_out[271]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[270]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[269]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[268]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[267]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[266]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[265]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[264]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[263]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[262]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[261]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[260]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[259]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[258]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[257]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[256]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[255]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[254]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[253]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[252]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[251]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[250]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[249]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[248]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[247]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[246]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[245]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[244]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[243]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[242]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[241]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[240]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[239]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[238]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[237]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[236]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[235]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[234]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[233]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[232]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[231]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[230]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[229]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[228]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[227]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[226]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[225]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[224]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[223]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[222]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[221]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[220]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[219]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[218]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[217]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[216]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[215]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[214]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[213]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[212]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[211]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[210]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[209]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[208]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[207]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[206]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[205]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[204]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[203]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[202]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[201]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[200]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[199]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[198]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[197]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[196]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[195]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[194]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[193]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[192]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[191]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[190]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[189]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[188]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[187]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[186]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[185]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[184]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[183]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[182]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[181]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[180]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[179]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[178]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[177]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[176]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[175]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[174]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[173]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[172]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[171]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[170]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[169]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[168]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[167]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[166]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[165]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[164]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[163]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[162]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[161]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[160]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[159]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[158]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[157]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[156]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[155]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[154]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[153]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[152]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[151]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[150]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[149]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[148]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[147]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[146]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[145]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[144]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[143]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[142]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[141]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[140]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[139]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[138]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[137]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[136]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[135]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[134]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[133]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[132]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[131]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[130]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[129]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[128]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[127]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[126]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[125]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[124]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[123]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[122]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[121]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[120]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[119]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[118]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[117]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[116]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[115]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[114]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[113]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[112]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[111]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[110]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[109]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[108]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[107]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[106]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[105]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[104]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[103]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[102]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[101]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[100]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[99]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[98]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[97]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[96]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[95]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[94]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[93]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[92]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[91]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[90]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[89]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[88]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[87]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[86]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[85]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[84]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[83]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[82]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[81]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[80]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[79]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[78]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[77]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[76]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[75]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[74]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[73]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[72]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[71]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[70]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[69]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[68]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[67]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[66]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[65]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[64]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[63]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[62]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[61]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[60]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[59]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[58]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[57]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[56]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[55]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[54]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[53]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[52]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[51]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[50]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[49]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[48]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[47]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[46]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[45]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[44]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[43]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[42]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[41]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[40]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[39]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[38]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[37]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[36]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[35]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[34]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[33]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[32]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[31]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[30]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[29]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[28]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[27]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[26]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[25]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[24]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[23]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[22]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[21]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[20]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[19]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[18]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[17]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[16]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[15]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[14]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[13]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[12]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[11]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[10]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[9]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[8]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[7]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[6]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[5]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[4]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[3]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[2]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[1]}]
set_load -pin_load 0.05 [get_ports {rd_data_out[0]}]
set_load -pin_load 0.05 [get_ports {sev_out[1]}]
set_load -pin_load 0.05 [get_ports {sev_out[0]}]
set_load -pin_load 0.05 [get_ports enc_valid_out]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[303]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[302]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[301]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[300]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[299]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[298]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[297]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[296]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[295]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[294]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[293]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[292]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[291]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[290]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[289]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[288]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[287]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[286]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[285]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[284]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[283]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[282]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[281]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[280]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[279]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[278]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[277]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[276]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[275]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[274]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[273]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[272]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[271]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[270]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[269]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[268]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[267]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[266]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[265]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[264]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[263]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[262]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[261]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[260]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[259]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[258]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[257]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[256]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[255]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[254]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[253]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[252]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[251]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[250]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[249]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[248]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[247]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[246]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[245]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[244]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[243]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[242]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[241]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[240]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[239]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[238]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[237]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[236]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[235]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[234]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[233]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[232]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[231]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[230]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[229]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[228]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[227]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[226]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[225]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[224]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[223]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[222]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[221]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[220]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[219]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[218]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[217]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[216]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[215]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[214]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[213]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[212]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[211]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[210]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[209]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[208]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[207]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[206]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[205]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[204]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[203]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[202]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[201]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[200]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[199]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[198]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[197]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[196]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[195]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[194]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[193]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[192]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[191]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[190]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[189]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[188]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[187]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[186]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[185]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[184]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[183]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[182]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[181]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[180]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[179]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[178]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[177]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[176]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[175]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[174]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[173]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[172]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[171]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[170]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[169]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[168]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[167]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[166]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[165]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[164]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[163]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[162]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[161]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[160]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[159]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[158]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[157]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[156]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[155]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[154]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[153]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[152]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[151]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[150]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[149]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[148]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[147]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[146]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[145]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[144]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[143]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[142]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[141]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[140]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[139]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[138]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[137]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[136]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[135]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[134]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[133]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[132]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[131]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[130]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[129]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[128]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[127]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[126]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[125]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[124]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[123]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[122]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[121]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[120]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[119]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[118]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[117]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[116]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[115]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[114]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[113]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[112]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[111]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[110]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[109]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[108]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[107]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[106]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[105]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[104]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[103]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[102]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[101]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[100]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[99]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[98]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[97]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[96]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[95]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[94]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[93]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[92]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[91]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[90]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[89]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[88]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[87]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[86]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[85]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[84]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[83]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[82]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[81]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[80]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[79]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[78]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[77]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[76]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[75]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[74]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[73]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[72]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[71]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[70]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[69]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[68]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[67]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[66]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[65]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[64]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[63]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[62]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[61]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[60]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[59]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[58]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[57]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[56]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[55]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[54]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[53]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[52]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[51]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[50]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[49]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[48]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[47]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[46]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[45]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[44]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[43]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[42]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[41]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[40]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[39]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[38]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[37]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[36]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[35]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[34]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[33]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[32]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[31]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[30]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[29]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[28]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[27]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[26]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[25]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[24]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[23]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[22]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[21]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[20]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[19]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[18]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[17]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[16]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[15]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[14]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[13]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[12]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[11]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[10]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[9]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[8]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[7]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[6]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[5]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[4]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[3]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[2]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[1]}]
set_load -pin_load 0.05 [get_ports {enc_codeword_out[0]}]
set_load -pin_load 0.05 [get_ports error_detected]
set_load -pin_load 0.05 [get_ports error_corrected]
set_load -pin_load 0.05 [get_ports uncorrectable]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0.2  [get_ports rst_n]
set_input_delay -clock clk  0.2  [get_ports test_mode_en]
set_input_delay -clock clk  0.2  [get_ports cw_sel]
set_input_delay -clock clk  0.2  [get_ports wr_valid]
set_input_delay -clock clk  0.2  [get_ports {wr_data[271]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[270]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[269]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[268]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[267]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[266]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[265]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[264]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[263]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[262]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[261]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[260]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[259]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[258]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[257]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[256]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[255]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[254]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[253]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[252]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[251]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[250]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[249]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[248]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[247]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[246]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[245]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[244]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[243]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[242]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[241]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[240]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[239]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[238]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[237]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[236]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[235]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[234]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[233]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[232]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[231]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[230]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[229]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[228]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[227]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[226]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[225]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[224]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[223]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[222]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[221]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[220]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[219]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[218]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[217]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[216]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[215]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[214]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[213]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[212]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[211]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[210]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[209]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[208]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[207]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[206]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[205]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[204]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[203]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[202]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[201]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[200]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[199]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[198]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[197]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[196]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[195]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[194]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[193]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[192]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[191]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[190]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[189]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[188]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[187]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[186]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[185]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[184]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[183]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[182]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[181]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[180]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[179]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[178]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[177]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[176]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[175]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[174]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[173]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[172]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[171]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[170]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[169]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[168]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[167]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[166]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[165]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[164]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[163]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[162]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[161]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[160]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[159]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[158]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[157]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[156]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[155]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[154]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[153]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[152]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[151]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[150]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[149]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[148]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[147]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[146]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[145]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[144]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[143]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[142]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[141]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[140]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[139]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[138]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[137]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[136]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[135]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[134]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[133]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[132]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[131]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[130]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[129]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[128]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[127]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[126]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[125]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[124]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[123]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[122]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[121]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[120]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[119]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[118]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[117]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[116]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[115]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[114]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[113]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[112]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[111]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[110]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[109]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[108]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[107]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[106]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[105]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[104]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[103]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[102]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[101]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[100]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[99]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[98]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[97]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[96]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[95]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[94]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[93]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[92]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[91]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[90]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[89]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[88]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[87]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[86]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[85]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[84]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[83]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[82]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[81]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[80]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[79]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[78]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[77]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[76]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[75]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[74]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[73]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[72]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[71]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[70]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[69]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[68]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[67]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[66]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[65]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[64]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[63]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[62]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[61]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[60]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[59]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[58]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[57]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[56]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[55]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[54]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[53]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[52]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[51]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[50]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[49]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[48]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[47]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[46]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[45]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[44]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[43]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[42]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[41]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[40]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[39]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[38]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[37]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[36]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[35]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[34]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[33]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[32]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[31]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[30]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[29]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[28]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[27]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[26]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[25]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[24]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[23]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[22]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[21]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[20]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[19]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[18]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[17]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[16]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[15]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[14]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[13]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[12]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[11]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[10]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[9]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[8]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[7]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[6]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[5]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[4]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[3]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[2]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[1]}]
set_input_delay -clock clk  0.2  [get_ports {wr_data[0]}]
set_input_delay -clock clk  0.2  [get_ports rd_valid]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[303]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[302]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[301]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[300]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[299]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[298]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[297]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[296]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[295]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[294]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[293]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[292]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[291]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[290]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[289]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[288]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[287]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[286]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[285]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[284]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[283]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[282]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[281]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[280]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[279]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[278]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[277]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[276]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[275]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[274]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[273]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[272]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[271]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[270]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[269]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[268]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[267]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[266]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[265]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[264]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[263]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[262]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[261]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[260]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[259]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[258]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[257]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[256]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[255]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[254]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[253]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[252]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[251]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[250]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[249]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[248]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[247]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[246]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[245]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[244]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[243]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[242]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[241]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[240]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[239]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[238]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[237]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[236]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[235]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[234]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[233]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[232]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[231]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[230]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[229]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[228]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[227]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[226]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[225]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[224]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[223]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[222]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[221]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[220]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[219]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[218]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[217]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[216]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[215]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[214]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[213]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[212]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[211]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[210]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[209]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[208]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[207]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[206]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[205]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[204]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[203]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[202]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[201]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[200]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[199]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[198]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[197]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[196]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[195]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[194]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[193]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[192]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[191]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[190]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[189]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[188]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[187]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[186]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[185]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[184]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[183]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[182]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[181]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[180]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[179]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[178]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[177]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[176]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[175]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[174]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[173]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[172]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[171]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[170]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[169]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[168]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[167]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[166]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[165]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[164]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[163]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[162]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[161]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[160]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[159]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[158]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[157]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[156]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[155]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[154]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[153]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[152]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[151]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[150]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[149]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[148]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[147]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[146]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[145]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[144]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[143]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[142]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[141]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[140]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[139]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[138]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[137]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[136]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[135]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[134]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[133]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[132]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[131]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[130]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[129]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[128]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[127]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[126]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[125]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[124]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[123]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[122]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[121]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[120]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[119]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[118]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[117]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[116]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[115]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[114]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[113]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[112]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[111]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[110]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[109]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[108]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[107]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[106]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[105]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[104]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[103]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[102]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[101]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[100]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[99]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[98]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[97]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[96]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[95]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[94]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[93]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[92]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[91]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[90]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[89]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[88]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[87]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[86]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[85]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[84]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[83]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[82]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[81]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[80]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[79]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[78]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[77]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[76]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[75]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[74]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[73]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[72]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[71]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[70]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[69]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[68]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[67]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[66]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[65]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[64]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[63]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[62]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[61]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[60]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[59]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[58]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[57]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[56]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[55]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[54]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[53]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[52]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[51]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[50]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[49]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[48]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[47]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[46]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[45]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[44]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[43]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[42]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[41]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[40]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[39]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[38]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[37]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[36]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[35]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[34]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[33]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[32]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[31]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[30]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[29]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[28]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[27]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[26]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[25]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[24]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[23]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[22]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[21]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[20]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[19]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[18]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[17]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[16]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[15]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[14]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[13]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[12]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[11]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[10]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[9]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[8]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[7]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[6]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[5]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[4]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[3]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[2]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[1]}]
set_input_delay -clock clk  0.2  [get_ports {rd_codeword[0]}]
set_input_delay -clock clk  0.2  [get_ports burst_start]
set_output_delay -clock clk  0.2  [get_ports wr_ready]
set_output_delay -clock clk  0.2  [get_ports rd_out_valid]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[271]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[270]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[269]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[268]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[267]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[266]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[265]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[264]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[263]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[262]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[261]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[260]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[259]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[258]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[257]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[256]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[255]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[254]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[253]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[252]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[251]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[250]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[249]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[248]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[247]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[246]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[245]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[244]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[243]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[242]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[241]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[240]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[239]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[238]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[237]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[236]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[235]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[234]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[233]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[232]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[231]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[230]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[229]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[228]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[227]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[226]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[225]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[224]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[223]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[222]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[221]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[220]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[219]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[218]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[217]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[216]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[215]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[214]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[213]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[212]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[211]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[210]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[209]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[208]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[207]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[206]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[205]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[204]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[203]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[202]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[201]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[200]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[199]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[198]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[197]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[196]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[195]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[194]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[193]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[192]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[191]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[190]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[189]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[188]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[187]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[186]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[185]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[184]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[183]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[182]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[181]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[180]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[179]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[178]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[177]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[176]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[175]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[174]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[173]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[172]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[171]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[170]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[169]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[168]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[167]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[166]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[165]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[164]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[163]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[162]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[161]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[160]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[159]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[158]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[157]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[156]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[155]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[154]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[153]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[152]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[151]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[150]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[149]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[148]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[147]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[146]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[145]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[144]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[143]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[142]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[141]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[140]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[139]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[138]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[137]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[136]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[135]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[134]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[133]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[132]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[131]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[130]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[129]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[128]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[127]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[126]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[125]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[124]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[123]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[122]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[121]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[120]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[119]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[118]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[117]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[116]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[115]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[114]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[113]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[112]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[111]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[110]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[109]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[108]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[107]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[106]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[105]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[104]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[103]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[102]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[101]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[100]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[99]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[98]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[97]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[96]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[95]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[94]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[93]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[92]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[91]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[90]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[89]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[88]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[87]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[86]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[85]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[84]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[83]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[82]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[81]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[80]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[79]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[78]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[77]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[76]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[75]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[74]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[73]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[72]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[71]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[70]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[69]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[68]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[67]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[66]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[65]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[64]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[63]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[62]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[61]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[60]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[59]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[58]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[57]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[56]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[55]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[54]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[53]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[52]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[51]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[50]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[49]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[48]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[47]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[46]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[45]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[44]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[43]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[42]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[41]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[40]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[39]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[38]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[37]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[36]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[35]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[34]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[33]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[32]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[31]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[30]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[29]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[28]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[27]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[26]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[25]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[24]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[23]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[22]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[21]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[20]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[19]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[18]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[17]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[16]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[15]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[14]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[13]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[12]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[11]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[10]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[9]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[8]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[7]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[6]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[5]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[4]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[3]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[2]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[1]}]
set_output_delay -clock clk  0.2  [get_ports {rd_data_out[0]}]
set_output_delay -clock clk  0.2  [get_ports {sev_out[1]}]
set_output_delay -clock clk  0.2  [get_ports {sev_out[0]}]
set_output_delay -clock clk  0.2  [get_ports enc_valid_out]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[303]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[302]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[301]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[300]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[299]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[298]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[297]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[296]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[295]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[294]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[293]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[292]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[291]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[290]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[289]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[288]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[287]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[286]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[285]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[284]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[283]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[282]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[281]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[280]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[279]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[278]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[277]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[276]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[275]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[274]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[273]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[272]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[271]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[270]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[269]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[268]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[267]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[266]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[265]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[264]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[263]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[262]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[261]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[260]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[259]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[258]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[257]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[256]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[255]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[254]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[253]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[252]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[251]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[250]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[249]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[248]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[247]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[246]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[245]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[244]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[243]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[242]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[241]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[240]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[239]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[238]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[237]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[236]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[235]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[234]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[233]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[232]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[231]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[230]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[229]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[228]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[227]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[226]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[225]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[224]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[223]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[222]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[221]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[220]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[219]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[218]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[217]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[216]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[215]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[214]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[213]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[212]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[211]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[210]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[209]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[208]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[207]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[206]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[205]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[204]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[203]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[202]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[201]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[200]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[199]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[198]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[197]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[196]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[195]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[194]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[193]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[192]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[191]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[190]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[189]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[188]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[187]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[186]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[185]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[184]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[183]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[182]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[181]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[180]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[179]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[178]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[177]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[176]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[175]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[174]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[173]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[172]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[171]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[170]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[169]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[168]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[167]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[166]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[165]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[164]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[163]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[162]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[161]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[160]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[159]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[158]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[157]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[156]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[155]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[154]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[153]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[152]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[151]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[150]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[149]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[148]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[147]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[146]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[145]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[144]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[143]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[142]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[141]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[140]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[139]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[138]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[137]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[136]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[135]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[134]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[133]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[132]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[131]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[130]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[129]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[128]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[127]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[126]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[125]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[124]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[123]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[122]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[121]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[120]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[119]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[118]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[117]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[116]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[115]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[114]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[113]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[112]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[111]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[110]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[109]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[108]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[107]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[106]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[105]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[104]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[103]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[102]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[101]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[100]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[99]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[98]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[97]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[96]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[95]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[94]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[93]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[92]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[91]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[90]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[89]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[88]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[87]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[86]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[85]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[84]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[83]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[82]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[81]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[80]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[79]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[78]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[77]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[76]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[75]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[74]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[73]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[72]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[71]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[70]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[69]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[68]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[67]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[66]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[65]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[64]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[63]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[62]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[61]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[60]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[59]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[58]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[57]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[56]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[55]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[54]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[53]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[52]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[51]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[50]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[49]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[48]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[47]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[46]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[45]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[44]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[43]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[42]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[41]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[40]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[39]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[38]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[37]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[36]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[35]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[34]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[33]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[32]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[31]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[30]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[29]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[28]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[27]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[26]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[25]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[24]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[23]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[22]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[21]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[20]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[19]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[18]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[17]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[16]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[15]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[14]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[13]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[12]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[11]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[10]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[9]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[8]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[7]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[6]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[5]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[4]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[3]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[2]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[1]}]
set_output_delay -clock clk  0.2  [get_ports {enc_codeword_out[0]}]
set_output_delay -clock clk  0.2  [get_ports error_detected]
set_output_delay -clock clk  0.2  [get_ports error_corrected]
set_output_delay -clock clk  0.2  [get_ports uncorrectable]
