###################################################################

# Created by write_sdc on Sat Mar 14 01:57:26 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_load -pin_load 0.05 [get_ports valid_out]
set_load -pin_load 0.05 [get_ports {codeword_out[303]}]
set_load -pin_load 0.05 [get_ports {codeword_out[302]}]
set_load -pin_load 0.05 [get_ports {codeword_out[301]}]
set_load -pin_load 0.05 [get_ports {codeword_out[300]}]
set_load -pin_load 0.05 [get_ports {codeword_out[299]}]
set_load -pin_load 0.05 [get_ports {codeword_out[298]}]
set_load -pin_load 0.05 [get_ports {codeword_out[297]}]
set_load -pin_load 0.05 [get_ports {codeword_out[296]}]
set_load -pin_load 0.05 [get_ports {codeword_out[295]}]
set_load -pin_load 0.05 [get_ports {codeword_out[294]}]
set_load -pin_load 0.05 [get_ports {codeword_out[293]}]
set_load -pin_load 0.05 [get_ports {codeword_out[292]}]
set_load -pin_load 0.05 [get_ports {codeword_out[291]}]
set_load -pin_load 0.05 [get_ports {codeword_out[290]}]
set_load -pin_load 0.05 [get_ports {codeword_out[289]}]
set_load -pin_load 0.05 [get_ports {codeword_out[288]}]
set_load -pin_load 0.05 [get_ports {codeword_out[287]}]
set_load -pin_load 0.05 [get_ports {codeword_out[286]}]
set_load -pin_load 0.05 [get_ports {codeword_out[285]}]
set_load -pin_load 0.05 [get_ports {codeword_out[284]}]
set_load -pin_load 0.05 [get_ports {codeword_out[283]}]
set_load -pin_load 0.05 [get_ports {codeword_out[282]}]
set_load -pin_load 0.05 [get_ports {codeword_out[281]}]
set_load -pin_load 0.05 [get_ports {codeword_out[280]}]
set_load -pin_load 0.05 [get_ports {codeword_out[279]}]
set_load -pin_load 0.05 [get_ports {codeword_out[278]}]
set_load -pin_load 0.05 [get_ports {codeword_out[277]}]
set_load -pin_load 0.05 [get_ports {codeword_out[276]}]
set_load -pin_load 0.05 [get_ports {codeword_out[275]}]
set_load -pin_load 0.05 [get_ports {codeword_out[274]}]
set_load -pin_load 0.05 [get_ports {codeword_out[273]}]
set_load -pin_load 0.05 [get_ports {codeword_out[272]}]
set_load -pin_load 0.05 [get_ports {codeword_out[271]}]
set_load -pin_load 0.05 [get_ports {codeword_out[270]}]
set_load -pin_load 0.05 [get_ports {codeword_out[269]}]
set_load -pin_load 0.05 [get_ports {codeword_out[268]}]
set_load -pin_load 0.05 [get_ports {codeword_out[267]}]
set_load -pin_load 0.05 [get_ports {codeword_out[266]}]
set_load -pin_load 0.05 [get_ports {codeword_out[265]}]
set_load -pin_load 0.05 [get_ports {codeword_out[264]}]
set_load -pin_load 0.05 [get_ports {codeword_out[263]}]
set_load -pin_load 0.05 [get_ports {codeword_out[262]}]
set_load -pin_load 0.05 [get_ports {codeword_out[261]}]
set_load -pin_load 0.05 [get_ports {codeword_out[260]}]
set_load -pin_load 0.05 [get_ports {codeword_out[259]}]
set_load -pin_load 0.05 [get_ports {codeword_out[258]}]
set_load -pin_load 0.05 [get_ports {codeword_out[257]}]
set_load -pin_load 0.05 [get_ports {codeword_out[256]}]
set_load -pin_load 0.05 [get_ports {codeword_out[255]}]
set_load -pin_load 0.05 [get_ports {codeword_out[254]}]
set_load -pin_load 0.05 [get_ports {codeword_out[253]}]
set_load -pin_load 0.05 [get_ports {codeword_out[252]}]
set_load -pin_load 0.05 [get_ports {codeword_out[251]}]
set_load -pin_load 0.05 [get_ports {codeword_out[250]}]
set_load -pin_load 0.05 [get_ports {codeword_out[249]}]
set_load -pin_load 0.05 [get_ports {codeword_out[248]}]
set_load -pin_load 0.05 [get_ports {codeword_out[247]}]
set_load -pin_load 0.05 [get_ports {codeword_out[246]}]
set_load -pin_load 0.05 [get_ports {codeword_out[245]}]
set_load -pin_load 0.05 [get_ports {codeword_out[244]}]
set_load -pin_load 0.05 [get_ports {codeword_out[243]}]
set_load -pin_load 0.05 [get_ports {codeword_out[242]}]
set_load -pin_load 0.05 [get_ports {codeword_out[241]}]
set_load -pin_load 0.05 [get_ports {codeword_out[240]}]
set_load -pin_load 0.05 [get_ports {codeword_out[239]}]
set_load -pin_load 0.05 [get_ports {codeword_out[238]}]
set_load -pin_load 0.05 [get_ports {codeword_out[237]}]
set_load -pin_load 0.05 [get_ports {codeword_out[236]}]
set_load -pin_load 0.05 [get_ports {codeword_out[235]}]
set_load -pin_load 0.05 [get_ports {codeword_out[234]}]
set_load -pin_load 0.05 [get_ports {codeword_out[233]}]
set_load -pin_load 0.05 [get_ports {codeword_out[232]}]
set_load -pin_load 0.05 [get_ports {codeword_out[231]}]
set_load -pin_load 0.05 [get_ports {codeword_out[230]}]
set_load -pin_load 0.05 [get_ports {codeword_out[229]}]
set_load -pin_load 0.05 [get_ports {codeword_out[228]}]
set_load -pin_load 0.05 [get_ports {codeword_out[227]}]
set_load -pin_load 0.05 [get_ports {codeword_out[226]}]
set_load -pin_load 0.05 [get_ports {codeword_out[225]}]
set_load -pin_load 0.05 [get_ports {codeword_out[224]}]
set_load -pin_load 0.05 [get_ports {codeword_out[223]}]
set_load -pin_load 0.05 [get_ports {codeword_out[222]}]
set_load -pin_load 0.05 [get_ports {codeword_out[221]}]
set_load -pin_load 0.05 [get_ports {codeword_out[220]}]
set_load -pin_load 0.05 [get_ports {codeword_out[219]}]
set_load -pin_load 0.05 [get_ports {codeword_out[218]}]
set_load -pin_load 0.05 [get_ports {codeword_out[217]}]
set_load -pin_load 0.05 [get_ports {codeword_out[216]}]
set_load -pin_load 0.05 [get_ports {codeword_out[215]}]
set_load -pin_load 0.05 [get_ports {codeword_out[214]}]
set_load -pin_load 0.05 [get_ports {codeword_out[213]}]
set_load -pin_load 0.05 [get_ports {codeword_out[212]}]
set_load -pin_load 0.05 [get_ports {codeword_out[211]}]
set_load -pin_load 0.05 [get_ports {codeword_out[210]}]
set_load -pin_load 0.05 [get_ports {codeword_out[209]}]
set_load -pin_load 0.05 [get_ports {codeword_out[208]}]
set_load -pin_load 0.05 [get_ports {codeword_out[207]}]
set_load -pin_load 0.05 [get_ports {codeword_out[206]}]
set_load -pin_load 0.05 [get_ports {codeword_out[205]}]
set_load -pin_load 0.05 [get_ports {codeword_out[204]}]
set_load -pin_load 0.05 [get_ports {codeword_out[203]}]
set_load -pin_load 0.05 [get_ports {codeword_out[202]}]
set_load -pin_load 0.05 [get_ports {codeword_out[201]}]
set_load -pin_load 0.05 [get_ports {codeword_out[200]}]
set_load -pin_load 0.05 [get_ports {codeword_out[199]}]
set_load -pin_load 0.05 [get_ports {codeword_out[198]}]
set_load -pin_load 0.05 [get_ports {codeword_out[197]}]
set_load -pin_load 0.05 [get_ports {codeword_out[196]}]
set_load -pin_load 0.05 [get_ports {codeword_out[195]}]
set_load -pin_load 0.05 [get_ports {codeword_out[194]}]
set_load -pin_load 0.05 [get_ports {codeword_out[193]}]
set_load -pin_load 0.05 [get_ports {codeword_out[192]}]
set_load -pin_load 0.05 [get_ports {codeword_out[191]}]
set_load -pin_load 0.05 [get_ports {codeword_out[190]}]
set_load -pin_load 0.05 [get_ports {codeword_out[189]}]
set_load -pin_load 0.05 [get_ports {codeword_out[188]}]
set_load -pin_load 0.05 [get_ports {codeword_out[187]}]
set_load -pin_load 0.05 [get_ports {codeword_out[186]}]
set_load -pin_load 0.05 [get_ports {codeword_out[185]}]
set_load -pin_load 0.05 [get_ports {codeword_out[184]}]
set_load -pin_load 0.05 [get_ports {codeword_out[183]}]
set_load -pin_load 0.05 [get_ports {codeword_out[182]}]
set_load -pin_load 0.05 [get_ports {codeword_out[181]}]
set_load -pin_load 0.05 [get_ports {codeword_out[180]}]
set_load -pin_load 0.05 [get_ports {codeword_out[179]}]
set_load -pin_load 0.05 [get_ports {codeword_out[178]}]
set_load -pin_load 0.05 [get_ports {codeword_out[177]}]
set_load -pin_load 0.05 [get_ports {codeword_out[176]}]
set_load -pin_load 0.05 [get_ports {codeword_out[175]}]
set_load -pin_load 0.05 [get_ports {codeword_out[174]}]
set_load -pin_load 0.05 [get_ports {codeword_out[173]}]
set_load -pin_load 0.05 [get_ports {codeword_out[172]}]
set_load -pin_load 0.05 [get_ports {codeword_out[171]}]
set_load -pin_load 0.05 [get_ports {codeword_out[170]}]
set_load -pin_load 0.05 [get_ports {codeword_out[169]}]
set_load -pin_load 0.05 [get_ports {codeword_out[168]}]
set_load -pin_load 0.05 [get_ports {codeword_out[167]}]
set_load -pin_load 0.05 [get_ports {codeword_out[166]}]
set_load -pin_load 0.05 [get_ports {codeword_out[165]}]
set_load -pin_load 0.05 [get_ports {codeword_out[164]}]
set_load -pin_load 0.05 [get_ports {codeword_out[163]}]
set_load -pin_load 0.05 [get_ports {codeword_out[162]}]
set_load -pin_load 0.05 [get_ports {codeword_out[161]}]
set_load -pin_load 0.05 [get_ports {codeword_out[160]}]
set_load -pin_load 0.05 [get_ports {codeword_out[159]}]
set_load -pin_load 0.05 [get_ports {codeword_out[158]}]
set_load -pin_load 0.05 [get_ports {codeword_out[157]}]
set_load -pin_load 0.05 [get_ports {codeword_out[156]}]
set_load -pin_load 0.05 [get_ports {codeword_out[155]}]
set_load -pin_load 0.05 [get_ports {codeword_out[154]}]
set_load -pin_load 0.05 [get_ports {codeword_out[153]}]
set_load -pin_load 0.05 [get_ports {codeword_out[152]}]
set_load -pin_load 0.05 [get_ports {codeword_out[151]}]
set_load -pin_load 0.05 [get_ports {codeword_out[150]}]
set_load -pin_load 0.05 [get_ports {codeword_out[149]}]
set_load -pin_load 0.05 [get_ports {codeword_out[148]}]
set_load -pin_load 0.05 [get_ports {codeword_out[147]}]
set_load -pin_load 0.05 [get_ports {codeword_out[146]}]
set_load -pin_load 0.05 [get_ports {codeword_out[145]}]
set_load -pin_load 0.05 [get_ports {codeword_out[144]}]
set_load -pin_load 0.05 [get_ports {codeword_out[143]}]
set_load -pin_load 0.05 [get_ports {codeword_out[142]}]
set_load -pin_load 0.05 [get_ports {codeword_out[141]}]
set_load -pin_load 0.05 [get_ports {codeword_out[140]}]
set_load -pin_load 0.05 [get_ports {codeword_out[139]}]
set_load -pin_load 0.05 [get_ports {codeword_out[138]}]
set_load -pin_load 0.05 [get_ports {codeword_out[137]}]
set_load -pin_load 0.05 [get_ports {codeword_out[136]}]
set_load -pin_load 0.05 [get_ports {codeword_out[135]}]
set_load -pin_load 0.05 [get_ports {codeword_out[134]}]
set_load -pin_load 0.05 [get_ports {codeword_out[133]}]
set_load -pin_load 0.05 [get_ports {codeword_out[132]}]
set_load -pin_load 0.05 [get_ports {codeword_out[131]}]
set_load -pin_load 0.05 [get_ports {codeword_out[130]}]
set_load -pin_load 0.05 [get_ports {codeword_out[129]}]
set_load -pin_load 0.05 [get_ports {codeword_out[128]}]
set_load -pin_load 0.05 [get_ports {codeword_out[127]}]
set_load -pin_load 0.05 [get_ports {codeword_out[126]}]
set_load -pin_load 0.05 [get_ports {codeword_out[125]}]
set_load -pin_load 0.05 [get_ports {codeword_out[124]}]
set_load -pin_load 0.05 [get_ports {codeword_out[123]}]
set_load -pin_load 0.05 [get_ports {codeword_out[122]}]
set_load -pin_load 0.05 [get_ports {codeword_out[121]}]
set_load -pin_load 0.05 [get_ports {codeword_out[120]}]
set_load -pin_load 0.05 [get_ports {codeword_out[119]}]
set_load -pin_load 0.05 [get_ports {codeword_out[118]}]
set_load -pin_load 0.05 [get_ports {codeword_out[117]}]
set_load -pin_load 0.05 [get_ports {codeword_out[116]}]
set_load -pin_load 0.05 [get_ports {codeword_out[115]}]
set_load -pin_load 0.05 [get_ports {codeword_out[114]}]
set_load -pin_load 0.05 [get_ports {codeword_out[113]}]
set_load -pin_load 0.05 [get_ports {codeword_out[112]}]
set_load -pin_load 0.05 [get_ports {codeword_out[111]}]
set_load -pin_load 0.05 [get_ports {codeword_out[110]}]
set_load -pin_load 0.05 [get_ports {codeword_out[109]}]
set_load -pin_load 0.05 [get_ports {codeword_out[108]}]
set_load -pin_load 0.05 [get_ports {codeword_out[107]}]
set_load -pin_load 0.05 [get_ports {codeword_out[106]}]
set_load -pin_load 0.05 [get_ports {codeword_out[105]}]
set_load -pin_load 0.05 [get_ports {codeword_out[104]}]
set_load -pin_load 0.05 [get_ports {codeword_out[103]}]
set_load -pin_load 0.05 [get_ports {codeword_out[102]}]
set_load -pin_load 0.05 [get_ports {codeword_out[101]}]
set_load -pin_load 0.05 [get_ports {codeword_out[100]}]
set_load -pin_load 0.05 [get_ports {codeword_out[99]}]
set_load -pin_load 0.05 [get_ports {codeword_out[98]}]
set_load -pin_load 0.05 [get_ports {codeword_out[97]}]
set_load -pin_load 0.05 [get_ports {codeword_out[96]}]
set_load -pin_load 0.05 [get_ports {codeword_out[95]}]
set_load -pin_load 0.05 [get_ports {codeword_out[94]}]
set_load -pin_load 0.05 [get_ports {codeword_out[93]}]
set_load -pin_load 0.05 [get_ports {codeword_out[92]}]
set_load -pin_load 0.05 [get_ports {codeword_out[91]}]
set_load -pin_load 0.05 [get_ports {codeword_out[90]}]
set_load -pin_load 0.05 [get_ports {codeword_out[89]}]
set_load -pin_load 0.05 [get_ports {codeword_out[88]}]
set_load -pin_load 0.05 [get_ports {codeword_out[87]}]
set_load -pin_load 0.05 [get_ports {codeword_out[86]}]
set_load -pin_load 0.05 [get_ports {codeword_out[85]}]
set_load -pin_load 0.05 [get_ports {codeword_out[84]}]
set_load -pin_load 0.05 [get_ports {codeword_out[83]}]
set_load -pin_load 0.05 [get_ports {codeword_out[82]}]
set_load -pin_load 0.05 [get_ports {codeword_out[81]}]
set_load -pin_load 0.05 [get_ports {codeword_out[80]}]
set_load -pin_load 0.05 [get_ports {codeword_out[79]}]
set_load -pin_load 0.05 [get_ports {codeword_out[78]}]
set_load -pin_load 0.05 [get_ports {codeword_out[77]}]
set_load -pin_load 0.05 [get_ports {codeword_out[76]}]
set_load -pin_load 0.05 [get_ports {codeword_out[75]}]
set_load -pin_load 0.05 [get_ports {codeword_out[74]}]
set_load -pin_load 0.05 [get_ports {codeword_out[73]}]
set_load -pin_load 0.05 [get_ports {codeword_out[72]}]
set_load -pin_load 0.05 [get_ports {codeword_out[71]}]
set_load -pin_load 0.05 [get_ports {codeword_out[70]}]
set_load -pin_load 0.05 [get_ports {codeword_out[69]}]
set_load -pin_load 0.05 [get_ports {codeword_out[68]}]
set_load -pin_load 0.05 [get_ports {codeword_out[67]}]
set_load -pin_load 0.05 [get_ports {codeword_out[66]}]
set_load -pin_load 0.05 [get_ports {codeword_out[65]}]
set_load -pin_load 0.05 [get_ports {codeword_out[64]}]
set_load -pin_load 0.05 [get_ports {codeword_out[63]}]
set_load -pin_load 0.05 [get_ports {codeword_out[62]}]
set_load -pin_load 0.05 [get_ports {codeword_out[61]}]
set_load -pin_load 0.05 [get_ports {codeword_out[60]}]
set_load -pin_load 0.05 [get_ports {codeword_out[59]}]
set_load -pin_load 0.05 [get_ports {codeword_out[58]}]
set_load -pin_load 0.05 [get_ports {codeword_out[57]}]
set_load -pin_load 0.05 [get_ports {codeword_out[56]}]
set_load -pin_load 0.05 [get_ports {codeword_out[55]}]
set_load -pin_load 0.05 [get_ports {codeword_out[54]}]
set_load -pin_load 0.05 [get_ports {codeword_out[53]}]
set_load -pin_load 0.05 [get_ports {codeword_out[52]}]
set_load -pin_load 0.05 [get_ports {codeword_out[51]}]
set_load -pin_load 0.05 [get_ports {codeword_out[50]}]
set_load -pin_load 0.05 [get_ports {codeword_out[49]}]
set_load -pin_load 0.05 [get_ports {codeword_out[48]}]
set_load -pin_load 0.05 [get_ports {codeword_out[47]}]
set_load -pin_load 0.05 [get_ports {codeword_out[46]}]
set_load -pin_load 0.05 [get_ports {codeword_out[45]}]
set_load -pin_load 0.05 [get_ports {codeword_out[44]}]
set_load -pin_load 0.05 [get_ports {codeword_out[43]}]
set_load -pin_load 0.05 [get_ports {codeword_out[42]}]
set_load -pin_load 0.05 [get_ports {codeword_out[41]}]
set_load -pin_load 0.05 [get_ports {codeword_out[40]}]
set_load -pin_load 0.05 [get_ports {codeword_out[39]}]
set_load -pin_load 0.05 [get_ports {codeword_out[38]}]
set_load -pin_load 0.05 [get_ports {codeword_out[37]}]
set_load -pin_load 0.05 [get_ports {codeword_out[36]}]
set_load -pin_load 0.05 [get_ports {codeword_out[35]}]
set_load -pin_load 0.05 [get_ports {codeword_out[34]}]
set_load -pin_load 0.05 [get_ports {codeword_out[33]}]
set_load -pin_load 0.05 [get_ports {codeword_out[32]}]
set_load -pin_load 0.05 [get_ports {codeword_out[31]}]
set_load -pin_load 0.05 [get_ports {codeword_out[30]}]
set_load -pin_load 0.05 [get_ports {codeword_out[29]}]
set_load -pin_load 0.05 [get_ports {codeword_out[28]}]
set_load -pin_load 0.05 [get_ports {codeword_out[27]}]
set_load -pin_load 0.05 [get_ports {codeword_out[26]}]
set_load -pin_load 0.05 [get_ports {codeword_out[25]}]
set_load -pin_load 0.05 [get_ports {codeword_out[24]}]
set_load -pin_load 0.05 [get_ports {codeword_out[23]}]
set_load -pin_load 0.05 [get_ports {codeword_out[22]}]
set_load -pin_load 0.05 [get_ports {codeword_out[21]}]
set_load -pin_load 0.05 [get_ports {codeword_out[20]}]
set_load -pin_load 0.05 [get_ports {codeword_out[19]}]
set_load -pin_load 0.05 [get_ports {codeword_out[18]}]
set_load -pin_load 0.05 [get_ports {codeword_out[17]}]
set_load -pin_load 0.05 [get_ports {codeword_out[16]}]
set_load -pin_load 0.05 [get_ports {codeword_out[15]}]
set_load -pin_load 0.05 [get_ports {codeword_out[14]}]
set_load -pin_load 0.05 [get_ports {codeword_out[13]}]
set_load -pin_load 0.05 [get_ports {codeword_out[12]}]
set_load -pin_load 0.05 [get_ports {codeword_out[11]}]
set_load -pin_load 0.05 [get_ports {codeword_out[10]}]
set_load -pin_load 0.05 [get_ports {codeword_out[9]}]
set_load -pin_load 0.05 [get_ports {codeword_out[8]}]
set_load -pin_load 0.05 [get_ports {codeword_out[7]}]
set_load -pin_load 0.05 [get_ports {codeword_out[6]}]
set_load -pin_load 0.05 [get_ports {codeword_out[5]}]
set_load -pin_load 0.05 [get_ports {codeword_out[4]}]
set_load -pin_load 0.05 [get_ports {codeword_out[3]}]
set_load -pin_load 0.05 [get_ports {codeword_out[2]}]
set_load -pin_load 0.05 [get_ports {codeword_out[1]}]
set_load -pin_load 0.05 [get_ports {codeword_out[0]}]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0.2  [get_ports rst_n]
set_input_delay -clock clk  0.2  [get_ports valid_in]
set_input_delay -clock clk  0.2  [get_ports {data_in[271]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[270]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[269]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[268]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[267]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[266]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[265]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[264]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[263]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[262]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[261]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[260]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[259]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[258]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[257]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[256]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[255]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[254]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[253]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[252]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[251]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[250]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[249]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[248]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[247]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[246]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[245]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[244]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[243]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[242]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[241]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[240]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[239]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[238]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[237]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[236]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[235]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[234]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[233]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[232]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[231]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[230]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[229]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[228]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[227]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[226]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[225]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[224]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[223]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[222]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[221]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[220]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[219]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[218]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[217]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[216]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[215]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[214]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[213]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[212]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[211]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[210]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[209]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[208]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[207]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[206]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[205]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[204]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[203]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[202]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[201]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[200]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[199]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[198]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[197]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[196]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[195]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[194]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[193]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[192]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[191]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[190]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[189]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[188]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[187]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[186]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[185]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[184]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[183]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[182]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[181]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[180]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[179]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[178]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[177]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[176]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[175]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[174]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[173]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[172]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[171]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[170]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[169]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[168]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[167]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[166]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[165]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[164]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[163]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[162]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[161]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[160]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[159]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[158]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[157]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[156]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[155]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[154]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[153]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[152]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[151]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[150]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[149]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[148]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[147]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[146]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[145]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[144]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[143]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[142]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[141]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[140]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[139]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[138]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[137]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[136]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[135]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[134]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[133]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[132]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[131]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[130]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[129]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[128]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[127]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[126]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[125]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[124]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[123]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[122]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[121]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[120]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[119]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[118]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[117]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[116]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[115]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[114]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[113]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[112]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[111]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[110]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[109]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[108]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[107]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[106]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[105]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[104]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[103]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[102]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[101]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[100]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[99]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[98]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[97]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[96]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[95]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[94]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[93]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[92]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[91]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[90]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[89]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[88]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[87]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[86]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[85]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[84]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[83]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[82]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[81]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[80]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[79]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[78]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[77]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[76]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[75]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[74]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[73]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[72]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[71]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[70]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[69]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[68]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[67]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[66]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[65]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[64]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[63]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[62]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[61]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[60]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[59]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[58]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[57]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[56]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[55]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[54]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[53]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[52]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[51]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[50]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[49]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[48]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[47]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[46]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[45]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[44]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[43]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[42]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[41]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[40]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[39]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[38]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[37]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[36]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[35]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[34]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[33]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[32]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[31]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[30]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[29]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[28]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[27]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[26]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[25]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[24]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[23]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[22]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[21]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[20]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[19]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[18]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[17]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[16]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[15]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[14]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[13]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[12]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[11]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[10]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[9]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[8]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[7]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[6]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[5]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[4]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[3]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[2]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[1]}]
set_input_delay -clock clk  0.2  [get_ports {data_in[0]}]
set_output_delay -clock clk  0.2  [get_ports valid_out]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[303]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[302]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[301]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[300]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[299]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[298]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[297]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[296]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[295]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[294]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[293]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[292]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[291]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[290]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[289]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[288]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[287]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[286]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[285]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[284]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[283]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[282]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[281]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[280]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[279]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[278]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[277]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[276]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[275]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[274]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[273]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[272]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[271]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[270]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[269]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[268]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[267]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[266]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[265]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[264]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[263]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[262]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[261]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[260]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[259]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[258]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[257]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[256]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[255]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[254]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[253]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[252]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[251]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[250]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[249]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[248]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[247]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[246]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[245]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[244]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[243]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[242]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[241]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[240]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[239]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[238]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[237]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[236]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[235]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[234]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[233]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[232]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[231]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[230]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[229]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[228]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[227]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[226]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[225]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[224]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[223]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[222]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[221]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[220]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[219]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[218]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[217]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[216]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[215]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[214]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[213]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[212]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[211]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[210]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[209]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[208]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[207]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[206]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[205]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[204]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[203]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[202]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[201]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[200]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[199]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[198]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[197]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[196]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[195]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[194]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[193]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[192]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[191]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[190]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[189]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[188]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[187]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[186]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[185]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[184]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[183]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[182]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[181]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[180]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[179]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[178]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[177]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[176]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[175]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[174]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[173]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[172]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[171]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[170]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[169]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[168]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[167]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[166]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[165]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[164]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[163]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[162]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[161]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[160]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[159]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[158]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[157]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[156]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[155]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[154]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[153]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[152]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[151]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[150]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[149]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[148]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[147]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[146]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[145]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[144]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[143]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[142]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[141]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[140]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[139]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[138]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[137]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[136]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[135]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[134]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[133]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[132]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[131]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[130]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[129]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[128]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[127]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[126]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[125]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[124]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[123]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[122]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[121]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[120]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[119]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[118]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[117]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[116]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[115]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[114]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[113]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[112]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[111]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[110]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[109]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[108]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[107]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[106]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[105]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[104]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[103]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[102]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[101]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[100]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[99]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[98]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[97]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[96]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[95]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[94]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[93]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[92]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[91]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[90]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[89]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[88]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[87]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[86]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[85]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[84]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[83]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[82]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[81]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[80]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[79]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[78]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[77]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[76]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[75]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[74]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[73]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[72]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[71]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[70]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[69]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[68]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[67]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[66]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[65]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[64]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[63]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[62]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[61]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[60]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[59]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[58]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[57]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[56]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[55]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[54]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[53]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[52]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[51]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[50]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[49]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[48]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[47]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[46]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[45]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[44]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[43]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[42]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[41]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[40]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[39]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[38]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[37]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[36]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[35]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[34]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[33]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[32]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[31]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[30]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[29]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[28]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[27]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[26]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[25]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[24]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[23]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[22]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[21]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[20]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[19]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[18]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[17]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[16]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[15]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[14]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[13]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[12]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[11]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[10]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[9]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[8]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[7]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[6]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[5]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[4]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[3]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[2]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[1]}]
set_output_delay -clock clk  0.2  [get_ports {codeword_out[0]}]
